# Используем официальный образ Node.js
FROM node:18-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json в рабочую директорию
COPY package*.json ./

# Устанавливаем все зависимости, включая devDependencies
RUN npm install

# Копируем все файлы проекта в контейнер
COPY . .

# Открываем порт, на котором будет работать приложение (например, 5173)
EXPOSE 5173

# Команда для запуска приложения
CMD ["npm", "run", "dev"]
